_posts/2022-02-05-boj-6118.html
---
title: BOJ 6118 숨바꼭질
tags: 최단거리
---

<div id="outline-container-orgf203d28" class="outline-2">
<h2 id="orgf203d28">BOJ 6118 숨바꼭질</h2>
</div>

<div id="outline-container-orgb08dd56" class="outline-2">
<h2 id="orgb08dd56">접근하기</h2>
<div class="outline-text-2" id="text-orgb08dd56">
<ul class="org-ul">
<li>edge에 가중치가 없는 graph에서의 최단거리 -&gt; BFS</li>
<li>가장 먼 거리에 있는 번호</li>
<li>가장 먼 거리의 길이 값</li>
<li>가장 먼 거리를 공통으로 가진 노드의 수</li>

<li>다익스트라로 푼 코드가 많음</li>
</ul>
</div>
</div>

<div id="outline-container-org19df93b" class="outline-2">
<h2 id="org19df93b">코드 - BFS</h2>
<div class="outline-text-2" id="text-org19df93b">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">FASTIO</span> <span style="color: #8ae234;">ios_base</span>::sync_with_stdio(<span style="color: #8ae234;">false</span>); cin.tie(<span style="color: #8ae234;">NULL</span>);
<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">ll</span>;
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">INF</span> 1e9

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span> &lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[20020];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">vis</span>[20020];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">start</span>)
{
    <span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">q</span>;
    q.push(start); 
    vis[start] = 1;

    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span> <span style="color: #ff6347;">next</span>:G[cur]) {
            <span style="color: #729fcf; font-weight: bold;">if</span> (vis[next] == 0) {
                vis[next] = vis[cur] + 1;            
                q.push(next);
            }
        }        
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    <span style="color: #8ae234; font-weight: bold;">FASTIO</span>
<span style="color: #729fcf;">#if</span><span style="color: #729fcf;">n</span><span style="color: #729fcf;">def</span> ONLINE_JUDGE
    <span style="color: #ff6347;">freopen</span>(<span style="color: #ad7fa8; font-style: italic;">"input.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
<span style="color: #729fcf;">#endif</span>
    cin &gt;&gt; N &gt;&gt; M;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        cin &gt;&gt; p1 &gt;&gt; p2;
        G[p1].push_back(p2);
        G[p2].push_back(p1);
    }
    bfs(1);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">maxv</span> = 0;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">maxv_idx</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (maxv &lt; vis[i]) {
            maxv = vis[i];
            maxv_idx = i;
        }
    }
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (vis[i] == maxv)
            ans++; 
    }

    cout &lt;&lt; maxv_idx &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
    cout &lt;&lt; maxv - 1 &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">" "</span>;
    cout &lt;&lt; ans &lt;&lt; <span style="color: #ad7fa8; font-style: italic;">'\n'</span>;
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge22e992" class="outline-2">
<h2 id="orge22e992"><span class="todo TODO">TODO</span> 코드 - 다익스트라</h2>
</div>

<div id="outline-container-orgb8f235b" class="outline-2">
<h2 id="orgb8f235b">문제 링크</h2>
<div class="outline-text-2" id="text-orgb8f235b">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/6118">https://www.acmicpc.net/problem/6118</a></li>
</ul>
</div>
</div>
